
let a = "\
A	B	C	Č	Ć	D	Dž	Đ	E	F	G	X	I	J	K \
А	Б	Ц	Ч	Ћ	Д	Џ	ђ	Е	Ф	Г	Х	И	Ј	К"

let c = "\
L	Lj	M	N	Nj	O	P	R	S	Š	T	U	V	Z	Ž \
Л	Љ	М	Н	Њ	О	П	Р	С	Ш	Т	У	В	З	Ж"


const roman_to_cyrillic: Record<string, string> = {
  'a':'а',
  'b':'б',
  'v':'в',
  'g':'г',
  'd':'д',
  'đ':'ђ',
  'e':'е',
  'ž':'ж',
  'z':'з',
  'i':'и',
  'j':'ј',
  'k':'к',
  'l':'л',
  'lj':'љ',
  'm':'м',
  'n':'н',
  'nj':'њ',
  'o':'о',
  'p':'п',
  'r':'р',
  's':'с',
  't':'т',
  'ć':'ћ',
  'u':'у',
  'f':'ф',
  'h':'х',
  'č':'ц',
  'dž':'џ',
  'š':'ш'
}